Octopus/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображениеДобавлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазовыеЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоСериям</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Octopus/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресКартинки = ОбщегоНазначения.ПолучитьАдресКартинкиТовара(Объект.Ссылка, УникальныйИдентификатор);

	Параметры.Свойство("Характеристика", Характеристика);
	Элементы.Характеристика.Видимость = ЗначениеЗаполнено(Характеристика);

	Параметры.Свойство("ИзменениеПараметровНоменклатуры", ИзменениеПараметровНоменклатуры);
	Если ИзменениеПараметровНоменклатуры Тогда
		Параметры.Свойство("ИдентификаторСтроки", ИдентификаторСтроки);
		ЗапросШтрихкоды = Новый Запрос;
		ЗапросШтрихкоды.УстановитьПараметр("Владелец", Объект.Ссылка);
		ЗапросШтрихкоды.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ИСТИНА КАК Существующий
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|";
		Штрихкоды.Загрузить(ЗапросШтрихкоды.Выполнить().Выгрузить());
		Элементы.Штрихкоды.ТекущаяСтрока = Неопределено;
	КонецЕсли;
	Элементы.СканироватьЧерезКамеруУстройства.Видимость = ИзменениеПараметровНоменклатуры;
	Элементы.ФормаГотово.Видимость = ИзменениеПараметровНоменклатуры;
	Элементы.Штрихкоды.Видимость = ИзменениеПараметровНоменклатуры;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если ИзменениеПараметровНоменклатуры И ВводДоступен()
		И Событие = "UniversalBroadcastEvent" и Источник = глНомерУстройства Тогда
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(Данные);
			ПостроительDOM = Новый ПостроительDOM;
			ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
			МассивЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("FilterData");
			Если МассивЭлементов.Количество() Тогда
				Штрихкод = МассивЭлементов[0].ТекстовоеСодержимое;
				ОбработатьВводШтрихкодаНаКлиенте(Штрихкод);
			КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ШтрихкодыПередУдалением(Элемент, Отказ)

	ТекущиеДанные = Элементы.Штрихкоды.ТекущиеДанные;
	Отказ = ТекущиеДанные.Существующий;

КонецПроцедуры

&НаСервере
Функция ИзменитьПараметрыНоменклатурыНаСервере()

	ТаблицаЗначенийШтрихкоды = РеквизитФормыВЗначение("Штрихкоды", Тип("ТаблицаЗначений"));
	ТаблицаНовыхШтрихкодов = ТаблицаЗначенийШтрихкоды.Скопировать(Новый Структура("Существующий", Ложь));
	ИзменилисьШтрихкоды = ТаблицаНовыхШтрихкодов.Количество();

	Если ИзменилисьШтрихкоды Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Номенклатура", Объект.Ссылка);
		Если ИзменилисьШтрихкоды Тогда
			СтруктураПараметров.Вставить("ТаблицаНовыхШтрихкодов", ТаблицаНовыхШтрихкодов);
		КонецЕсли;
		Результат = Разработка.ИзменитьПараметрыНоменклатуры(СтруктураПараметров);
		Если Результат = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура Готово(Команда)

	Если ИзменитьПараметрыНоменклатурыНаСервере() Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СканироватьЧерезКамеруУстройства(Команда)

	НажатаКомандаСканированияЧерезКамеру = Истина;
	ЗапуститьСканированиеЧерезКамеруУстройства();

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСканированиеЧерезКамеруУстройства()

	ИдетСканированиеЧерезКамеру = Истина;
	#Если МобильноеПриложениеКлиент Тогда
	ОбработчикСканирования = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗавершение", ЭтаФорма);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗакрытие", ЭтаФорма);
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(, ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Линейный);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОстановитьСканированиеЧерезКамеруУстройства()

	Если ИдетСканированиеЧерезКамеру Тогда
		ПрограммноеЗакрытиеСканированияЧерезКамеру = Истина;
		#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		ИдетСканированиеЧерезКамеру = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗавершение(ОтсканированныйШтрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт

	ОбработатьВводШтрихкодаНаКлиенте(СокрЛП(ОтсканированныйШтрихкод));

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗакрытие(ДополнительныеПараметры) Экспорт

	Если НЕ ПрограммноеЗакрытиеСканированияЧерезКамеру Тогда
		НажатаКомандаСканированияЧерезКамеру = Ложь;
	КонецЕсли;
	ПрограммноеЗакрытиеСканированияЧерезКамеру = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШтрихкодаНаКлиенте(Штрихкод)

	Если НЕ ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;

	МассивСтрок = Штрихкоды.НайтиСтроки(Новый Структура("Штрихкод", Штрихкод));
	Если МассивСтрок.Количество() Тогда
		СтрокаШтрихкоды = МассивСтрок[0];
	Иначе
		СтрокаШтрихкоды = Штрихкоды.Добавить();
		СтрокаШтрихкоды.Штрихкод = Штрихкод;
	КонецЕсли;
	Элементы.Штрихкоды.ТекущаяСтрока = СтрокаШтрихкоды.ПолучитьИдентификатор();

КонецПроцедуры
